In [2]:
# pandas 라이브러리를 Import하기
import pandas as pd

In [3]:
# 데이터 파일을 읽어오기
df = pd.read_csv(r'data/rocksamples.csv')

In [4]:
# 데이터프레임 처음과 마지막 5개행 확인하기
df.head(5)

      ID   Mission    Type   Subtype  Weight (g)  Pristine (%)
0  10001  Apollo11    Soil  Unsieved       125.8         88.36
1  10002  Apollo11    Soil  Unsieved      5629.0         93.73
2  10003  Apollo11  Basalt  Ilmenite       213.0         65.56
3  10004  Apollo11    Core  Unsieved        44.8         71.76
4  10005  Apollo11    Core  Unsieved        53.4         40.31

In [5]:
df.tail(5)

         ID   Mission     Type   Subtype  Weight (g)  Pristine (%)
2224  79528  Apollo17  Breccia  Regolith        2.38         100.0
2225  79529  Apollo17  Breccia  Regolith        1.84         100.0
2226  79535  Apollo17  Breccia  Regolith        1.69         100.0
2227  79536  Apollo17  Breccia  Regolith        1.66         100.0
2228  79537  Apollo17  Breccia  Regolith        1.05         100.0

In [6]:
#df 데이터프레임 정보 확인하기
df.info

<bound method DataFrame.info of          ID   Mission     Type   Subtype  Weight (g)  Pristine (%)
0     10001  Apollo11     Soil  Unsieved      125.80         88.36
1     10002  Apollo11     Soil  Unsieved     5629.00         93.73
2     10003  Apollo11   Basalt  Ilmenite      213.00         65.56
3     10004  Apollo11     Core  Unsieved       44.80         71.76
4     10005  Apollo11     Core  Unsieved       53.40         40.31
...     ...       ...      ...       ...         ...           ...
2224  79528  Apollo17  Breccia  Regolith        2.38        100.00
2225  79529  Apollo17  Breccia  Regolith        1.84        100.00
2226  79535  Apollo17  Breccia  Regolith        1.69        100.00
2227  79536  Apollo17  Breccia  Regolith        1.66        100.00
2228  79537  Apollo17  Breccia  Regolith        1.05        100.00

[2229 rows x 6 columns]>

In [7]:
#df 데이터프레임 행수 확인
df.shape[0]

2229

In [8]:
#df 데이터 프레임의 인덱스 확인
df.index

RangeIndex(start=0, stop=2229, step=1)

In [9]:
#df 데이터프레임 열수 확인
df.shape[1]

6

In [10]:
#df 데이터프레임의 모양 확인
df.shape

(2229, 6)

In [11]:
#df 데이터프레임의 컬럼명 확인
df.columns

Index(['ID', 'Mission', 'Type', 'Subtype', 'Weight (g)', 'Pristine (%)'], dtype='object')

In [12]:
#df 데이터프레임 컬럼들의 데이터타입 확인
df.dtypes

ID                int64
Mission          object
Type             object
Subtype          object
Weight (g)      float64
Pristine (%)    float64
dtype: object

In [13]:
# df 데이터프레임 수치 데이터의 요약 통계 확인
df.describe()

                 ID    Weight (g)  Pristine (%)
count   2229.000000   2229.000000   2229.000000
mean   52058.432032    168.253024     84.512764
std    26207.651471    637.286458     22.057299
min    10001.000000      0.000000      0.000000
25%    15437.000000      3.000000     80.010000
50%    65527.000000     10.200000     92.300000
75%    72142.000000     93.490000     98.140000
max    79537.000000  11729.000000    180.000000

## 각 컬럼별 누락값 검사

In [14]:
# 1단계 -> df 데이터프레임에 null값이 있는지 확인
df.isnull()

         ID  Mission   Type  Subtype  Weight (g)  Pristine (%)
0     False    False  False    False       False         False
1     False    False  False    False       False         False
2     False    False  False    False       False         False
3     False    False  False    False       False         False
4     False    False  False    False       False         False
...     ...      ...    ...      ...         ...           ...
2224  False    False  False    False       False         False
2225  False    False  False    False       False         False
2226  False    False  False    False       False         False
2227  False    False  False    False       False         False
2228  False    False  False    False       False         False

[2229 rows x 6 columns]

In [15]:
#결측치 갯수 확인. false:0, True:1
df.isnull().sum()

ID              0
Mission         0
Type            0
Subtype         3
Weight (g)      0
Pristine (%)    0
dtype: int64

In [16]:
df.isnull().any()

ID              False
Mission         False
Type            False
Subtype          True
Weight (g)      False
Pristine (%)    False
dtype: bool

In [17]:
df.isnull().any(axis=1)

0       False
1       False
2       False
3       False
4       False
        ...
2224    False
2225    False
2226    False
2227    False
2228    False
Length: 2229, dtype: bool

In [18]:
# 결측치가 있는 행만 출력
df[df['Subtype'].isnull()]

         ID   Mission     Type Subtype  Weight (g)  Pristine (%)
89    12023  Apollo12  Special     NaN      407.90         66.89
355   15014  Apollo15  Special     NaN      333.20        100.00
1513  70149  Apollo17   Basalt     NaN        0.95          0.00

In [19]:
df[df.isnull().any(axis=1)]

         ID   Mission     Type Subtype  Weight (g)  Pristine (%)
89    12023  Apollo12  Special     NaN      407.90         66.89
355   15014  Apollo15  Special     NaN      333.20        100.00
1513  70149  Apollo17   Basalt     NaN        0.95          0.00

## 컬럼값 변환 : weight(g) -> weight(kg)

In [20]:
pd.options.display.float_format = '{:.6f}'.format

In [21]:
df.head(2)

      ID   Mission  Type   Subtype  Weight (g)  Pristine (%)
0  10001  Apollo11  Soil  Unsieved  125.800000     88.360000
1  10002  Apollo11  Soil  Unsieved 5629.000000     93.730000

In [22]:
df['Weight (g)']

0       125.800000
1      5629.000000
2       213.000000
3        44.800000
4        53.400000
           ...
2224      2.380000
2225      1.840000
2226      1.690000
2227      1.660000
2228      1.050000
Name: Weight (g), Length: 2229, dtype: float64

In [23]:
# 1단계 -> 컬럼값변환 : df['Weight (g)'] -> df['Weight (kg)]
df['Weight (g)'] = df['Weight (g)'] * 0.001
df.head(5)
#df['Weight (g)'].apply(lambda x: x / 1000)

      ID   Mission    Type   Subtype  Weight (g)  Pristine (%)
0  10001  Apollo11    Soil  Unsieved    0.125800     88.360000
1  10002  Apollo11    Soil  Unsieved    5.629000     93.730000
2  10003  Apollo11  Basalt  Ilmenite    0.213000     65.560000
3  10004  Apollo11    Core  Unsieved    0.044800     71.760000
4  10005  Apollo11    Core  Unsieved    0.053400     40.310000

In [24]:
#2단계 -> 컬럼명 변환 : 'Weight(g)' -> 'Weight(kg)
df.rename(columns={'Weight (g)': 'Weight (kg)'}, inplace=True)
df

         ID   Mission     Type   Subtype  Weight (kg)  Pristine (%)
0     10001  Apollo11     Soil  Unsieved     0.125800     88.360000
1     10002  Apollo11     Soil  Unsieved     5.629000     93.730000
2     10003  Apollo11   Basalt  Ilmenite     0.213000     65.560000
3     10004  Apollo11     Core  Unsieved     0.044800     71.760000
4     10005  Apollo11     Core  Unsieved     0.053400     40.310000
...     ...       ...      ...       ...          ...           ...
2224  79528  Apollo17  Breccia  Regolith     0.002380    100.000000
2225  79529  Apollo17  Breccia  Regolith     0.001840    100.000000
2226  79535  Apollo17  Breccia  Regolith     0.001690    100.000000
2227  79536  Apollo17  Breccia  Regolith     0.001660    100.000000
2228  79537  Apollo17  Breccia  Regolith     0.001050    100.000000

[2229 rows x 6 columns]

## 아폴로 임무별 데이터 프레임 만들기 : missions

In [25]:
# 빈 데이터 프레임을 만들고 변수 missions에 할당한다.
import pandas as pd

missions = pd.DataFrame()

In [26]:
type(missions)

pandas.core.frame.DataFrame

In [27]:
#df['Mission']의 중복되지 않은 고유값들을 알아본다.
df['Mission'].unique()

array(['Apollo11', 'Apollo12', 'Apollo14', 'Apollo15', 'Apollo16',
       'Apollo17'], dtype=object)

In [28]:
df['Type'].unique()

array(['Soil', 'Basalt', 'Core', 'Breccia', 'Special', 'Crustal'],
      dtype=object)

In [29]:
df['Subtype'].unique()

array(['Unsieved', 'Ilmenite', 'Regolith', 'Cristobalite', 'Olivine',
       'Pigeonite', 'Fragmental', nan, 'Feldspathic', 'Unclassified',
       '2-4mm', '1-2mm', '<1mm', '4-10mm', '>10mm', 'ImpactMelt', 'KREEP',
       'Glass', 'Agglomerate', 'Unstudied', 'Cataclastic', 'Clod',
       'Anorthosite', 'unsieved', 'Plagioclase', 'fragmental',
       'unstudied', 'notstudied', 'Cataclasite', 'Troctolite', 'Norite',
       'Pristine'], dtype=object)

In [30]:
missions['Mission'] = df['Mission'].unique()
missions

    Mission
0  Apollo11
1  Apollo12
2  Apollo14
3  Apollo15
4  Apollo16
5  Apollo17

In [31]:
#위의 값들을 mission 데이터프레임의 새로운 컬럼인 mission['Mission']에 할당한다.

#### 아폴로 임무별 샘플 중량 총합

In [32]:
# df 데이터프레임의 'Mission' 컬럼을 기준으로 그룹으로 나눈다 -> groupby()
# 나누어진 그룹에서 'weight (kg)' 컬럼의 총합을 구한다 -> 
# groupby('Mission')['weight (kg)].sum()
# 결국 아폴로 달탐사 임무별로 수집해온 암석 샘플 총중량을 구해서 새로운 변수에 할당한다. -> 이 변수는 시리즈이다.

In [33]:
#missions = pd.DatFrame()

missions['Mission'] = df['Mission'].unique()

In [34]:
df.groupby('Mission')['Weight (kg)'].sum().values

array([ 21.55424,  34.34238,  41.83363,  75.3991 ,  92.46262, 109.44402])

In [35]:
# missions 데이터프레임과 sample_total_weight 시리즈를 병합한다.
# 컬럼명을 'Weight (kg)' 을 'Sample weight (kg)'으로 변경한다.

missions['Sample weight (kg)'] = df.groupby('Mission')['Weight (kg)'].sum().values

In [36]:
# 아폴로 미션별 채취한 암석의 총 중량
missions

    Mission  Sample weight (kg)
0  Apollo11           21.554240
1  Apollo12           34.342380
2  Apollo14           41.833630
3  Apollo15           75.399100
4  Apollo16           92.462620
5  Apollo17          109.444020

In [37]:
# 임무간 중량 차이 구하기
#1. 임무간 암석의 중량 차이를 구하고, 어떤식으로 증가했는지 패턴을 살펴본다
#2. 우주선 무게 증감 데이터

In [38]:
# 아폴로 임무간의 수집해온 암석 샘플 총중량 차이를 나타내는 컬럼  'Weight diff'를 missions 데이터프레임에 추가
missions['Weight diff'] = missions['Sample weight (kg)'].diff()
missions

    Mission  Sample weight (kg)  Weight diff
0  Apollo11           21.554240          NaN
1  Apollo12           34.342380    12.788140
2  Apollo14           41.833630     7.491250
3  Apollo15           75.399100    33.565470
4  Apollo16           92.462620    17.063520
5  Apollo17          109.444020    16.981400

In [39]:
# 아폴로 11은 그 전 달탐사가 없어 NaN 값을 가지므로 결측치 0으로 채우기
missions.fillna(value=0, inplace=True)
missions

    Mission  Sample weight (kg)  Weight diff
0  Apollo11           21.554240     0.000000
1  Apollo12           34.342380    12.788140
2  Apollo14           41.833630     7.491250
3  Apollo15           75.399100    33.565470
4  Apollo16           92.462620    17.063520
5  Apollo17          109.444020    16.981400

In [40]:
# 달탐사선 = 달모듈 + 명령모듈 --> 이 둘을 합쳐서 승무원 모듈
# 달 모듈의 이름, 중량 컬럼을 missions 데이터프레임에 추가
#달모듈이름 = ['Eagle (LM-5)', 'Intrepid (LM-6)', 'Antares (LM-8)', 'Falcon (LM-10)', 'Orion (LM-11)', 'Challenger (LM-12)']
#달모듈중량 = [15103, 15235, 15264, 16430, 16445, 16456]
missions['Lunar module (LM)'] = ['Eagle (LM-5)', 'Intrepid (LM-6)', 'Antares (LM-8)', 'Falcon (LM-10)', 'Orion (LM-11)', 'Challenger (LM-12)']
missions['LM mass (kg)'] = [15103, 15235, 15264, 16430, 16445, 16456]

missions

    Mission  Sample weight (kg)  Weight diff   Lunar module (LM)  LM mass (kg)
0  Apollo11           21.554240     0.000000        Eagle (LM-5)         15103
1  Apollo12           34.342380    12.788140     Intrepid (LM-6)         15235
2  Apollo14           41.833630     7.491250      Antares (LM-8)         15264
3  Apollo15           75.399100    33.565470      Falcon (LM-10)         16430
4  Apollo16           92.462620    17.063520       Orion (LM-11)         16445
5  Apollo17          109.444020    16.981400  Challenger (LM-12)         16456

In [41]:
# 아폴로 임무별로 달모듈 중량 차이를 구해서 새로운 컬럼 'LM mass diff'를 만들어서  missions 데이터프레임에 추가

missions['LM mass diff'] = missions['LM mass (kg)'].diff()
missions

,Mission,Sample weight (kg),Weight diff,Lunar module (LM),LM mass (kg),LM mass diff
0,Apollo11,21.554240,0.000000,Eagle (LM-5),15103,NaN
1,Apollo12,34.342380,12.788140,Intrepid (LM-6),15235,132.000000
2,Apollo14,41.833630,7.491250,Antares (LM-8),15264,29.000000
3,Apollo15,75.399100,33.565470,Falcon (LM-10),16430,1166.000000
4,Apollo16,92.462620,17.063520,Orion (LM-11),16445,15.000000
5,Apollo17,109.444020,16.981400,Challenger (LM-12),16456,11.000000

In [42]:
# 결측치가 있다면 0으로 채우기

missions.fillna(value=0, inplace=True)
missions

,Mission,Sample weight (kg),Weight diff,Lunar module (LM),LM mass (kg),LM mass diff
0,Apollo11,21.554240,0.000000,Eagle (LM-5),15103,0.000000
1,Apollo12,34.342380,12.788140,Intrepid (LM-6),15235,132.000000
2,Apollo14,41.833630,7.491250,Antares (LM-8),15264,29.000000
3,Apollo15,75.399100,33.565470,Falcon (LM-10),16430,1166.000000
4,Apollo16,92.462620,17.063520,Orion (LM-11),16445,15.000000
5,Apollo17,109.444020,16.981400,Challenger (LM-12),16456,11.000000

In [43]:
#명령모듈의 이름, 중량 컬럼을 missionms 데이터프레임에 추가
#명령모듈이름 = ['Columbia (CSM-107]', 'Yankee Clipper (CM-100])', 'Kitty Hawk (CM-110)', 'Endeavor (CM-112)', 'Casper (CM-113)', 'America (CM-114)']
#명령모듈중량 = [5560, 5609, 5758, 5875, 5840, 5960]

missions['Command Module (CM)'] = ['Columbia (CSM-107]', 'Yankee Clipper (CM-100])', 'Kitty Hawk (CM-110)', 'Endeavor (CM-112)', 'Casper (CM-113)', 'America (CM-114)']
missions['CM mass (kg)'] = [5560, 5609, 5758, 5875, 5840, 5960]

missions

,Mission,Sample weight (kg),Weight diff,Lunar module (LM),LM mass (kg),LM mass diff,Command Module (CM),CM mass (kg)
0,Apollo11,21.554240,0.000000,Eagle (LM-5),15103,0.000000,Columbia (CSM-107],5560
1,Apollo12,34.342380,12.788140,Intrepid (LM-6),15235,132.000000,Yankee Clipper (CM-100]),5609
2,Apollo14,41.833630,7.491250,Antares (LM-8),15264,29.000000,Kitty Hawk (CM-110),5758
3,Apollo15,75.399100,33.565470,Falcon (LM-10),16430,1166.000000,Endeavor (CM-112),5875
4,Apollo16,92.462620,17.063520,Orion (LM-11),16445,15.000000,Casper (CM-113),5840
5,Apollo17,109.444020,16.981400,Challenger (LM-12),16456,11.000000,America (CM-114),5960

In [44]:
#임무간 명령 모듈 중량 차이 구하기기
#아폴로 임무별로 명령모듈 중량 차이를 구해서 새로운 컬럼 'CM Mass diff'를 만들어 missions 데이터프레임에 추가

missions['CM mass diff'] = missions['CM mass (kg)'].diff()
missions.fillna(value=0, inplace=True)
missions

,Mission,Sample weight (kg),Weight diff,Lunar module (LM),LM mass (kg),LM mass diff,Command Module (CM),CM mass (kg),CM mass diff
0,Apollo11,21.554240,0.000000,Eagle (LM-5),15103,0.000000,Columbia (CSM-107],5560,0.000000
1,Apollo12,34.342380,12.788140,Intrepid (LM-6),15235,132.000000,Yankee Clipper (CM-100]),5609,49.000000
2,Apollo14,41.833630,7.491250,Antares (LM-8),15264,29.000000,Kitty Hawk (CM-110),5758,149.000000
3,Apollo15,75.399100,33.565470,Falcon (LM-10),16430,1166.000000,Endeavor (CM-112),5875,117.000000
4,Apollo16,92.462620,17.063520,Orion (LM-11),16445,15.000000,Casper (CM-113),5840,-35.000000
5,Apollo17,109.444020,16.981400,Challenger (LM-12),16456,11.000000,America (CM-114),5960,120.000000

In [45]:
# 승무원영역 = 달모듈 + 명령모듈
# 달 모듈과 명령모듈 중량을 합한 값을 'Total weight (kg)'라는 새로운 컬럼을 만들어 missions 데이터프레임에 추가

missions['Total weight (kg)'] = missions['CM mass (kg)'] + missions['LM mass (kg)']
missions

,Mission,Sample weight (kg),Weight diff,Lunar module (LM),LM mass (kg),LM mass diff,Command Module (CM),CM mass (kg),CM mass diff,Total weight (kg)
0,Apollo11,21.554240,0.000000,Eagle (LM-5),15103,0.000000,Columbia (CSM-107],5560,0.000000,20663
1,Apollo12,34.342380,12.788140,Intrepid (LM-6),15235,132.000000,Yankee Clipper (CM-100]),5609,49.000000,20844
2,Apollo14,41.833630,7.491250,Antares (LM-8),15264,29.000000,Kitty Hawk (CM-110),5758,149.000000,21022
3,Apollo15,75.399100,33.565470,Falcon (LM-10),16430,1166.000000,Endeavor (CM-112),5875,117.000000,22305
4,Apollo16,92.462620,17.063520,Orion (LM-11),16445,15.000000,Casper (CM-113),5840,-35.000000,22285
5,Apollo17,109.444020,16.981400,Challenger (LM-12),16456,11.000000,America (CM-114),5960,120.000000,22416

In [46]:
# 승무원 영역을 나타내는 'Total weight (kg)'의 아폴로 임무별 중량 차이를 구하는 새로운 컬럼 'Total weight diff'를 missions 데이터프레임에 추가
missions['Total weight diff'] = missions['Total weight (kg)'].diff()
missions.fillna(value=0, inplace=True)
missions

,Mission,Sample weight (kg),Weight diff,Lunar module (LM),LM mass (kg),LM mass diff,Command Module (CM),CM mass (kg),CM mass diff,Total weight (kg),Total weight diff
0,Apollo11,21.554240,0.000000,Eagle (LM-5),15103,0.000000,Columbia (CSM-107],5560,0.000000,20663,0.000000
1,Apollo12,34.342380,12.788140,Intrepid (LM-6),15235,132.000000,Yankee Clipper (CM-100]),5609,49.000000,20844,181.000000
2,Apollo14,41.833630,7.491250,Antares (LM-8),15264,29.000000,Kitty Hawk (CM-110),5758,149.000000,21022,178.000000
3,Apollo15,75.399100,33.565470,Falcon (LM-10),16430,1166.000000,Endeavor (CM-112),5875,117.000000,22305,1283.000000
4,Apollo16,92.462620,17.063520,Orion (LM-11),16445,15.000000,Casper (CM-113),5840,-35.000000,22285,-20.000000
5,Apollo17,109.444020,16.981400,Challenger (LM-12),16456,11.000000,America (CM-114),5960,120.000000,22416,131.000000

In [47]:
# 승무원 영역에서 암석 샘플이 차지하는 비율 구하기 -> 'Sample : Crewed area'
saturnVPayload = 43500
missions['Sample : Crewed area'] = missions['Total weight (kg)'] / saturnVPayload
missions

,Mission,Sample weight (kg),Weight diff,Lunar module (LM),LM mass (kg),LM mass diff,Command Module (CM),CM mass (kg),CM mass diff,Total weight (kg),Total weight diff,Sample : Crewed area
0,Apollo11,21.554240,0.000000,Eagle (LM-5),15103,0.000000,Columbia (CSM-107],5560,0.000000,20663,0.000000,0.475011
1,Apollo12,34.342380,12.788140,Intrepid (LM-6),15235,132.000000,Yankee Clipper (CM-100]),5609,49.000000,20844,181.000000,0.479172
2,Apollo14,41.833630,7.491250,Antares (LM-8),15264,29.000000,Kitty Hawk (CM-110),5758,149.000000,21022,178.000000,0.483264
3,Apollo15,75.399100,33.565470,Falcon (LM-10),16430,1166.000000,Endeavor (CM-112),5875,117.000000,22305,1283.000000,0.512759
4,Apollo16,92.462620,17.063520,Orion (LM-11),16445,15.000000,Casper (CM-113),5840,-35.000000,22285,-20.000000,0.512299
5,Apollo17,109.444020,16.981400,Challenger (LM-12),16456,11.000000,America (CM-114),5960,120.000000,22416,131.000000,0.515310

In [48]:
# 페이로드에서 승무원 영역이 차지하는 비율 구하기 -> 'Crewed area : Payload'
saturnVPayload = 43500
missions['Crewed area : Payload'] = missions['Total weight (kg)'] / saturnVPayload
missions

,Mission,Sample weight (kg),Weight diff,Lunar module (LM),LM mass (kg),LM mass diff,Command Module (CM),CM mass (kg),CM mass diff,Total weight (kg),Total weight diff,Sample : Crewed area,Crewed area : Payload
0,Apollo11,21.554240,0.000000,Eagle (LM-5),15103,0.000000,Columbia (CSM-107],5560,0.000000,20663,0.000000,0.475011,0.475011
1,Apollo12,34.342380,12.788140,Intrepid (LM-6),15235,132.000000,Yankee Clipper (CM-100]),5609,49.000000,20844,181.000000,0.479172,0.479172
2,Apollo14,41.833630,7.491250,Antares (LM-8),15264,29.000000,Kitty Hawk (CM-110),5758,149.000000,21022,178.000000,0.483264,0.483264
3,Apollo15,75.399100,33.565470,Falcon (LM-10),16430,1166.000000,Endeavor (CM-112),5875,117.000000,22305,1283.000000,0.512759,0.512759
4,Apollo16,92.462620,17.063520,Orion (LM-11),16445,15.000000,Casper (CM-113),5840,-35.000000,22285,-20.000000,0.512299,0.512299
5,Apollo17,109.444020,16.981400,Challenger (LM-12),16456,11.000000,America (CM-114),5960,120.000000,22416,131.000000,0.515310,0.515310

In [49]:
# 승무원 영역에서 암석 샘플이 차지하는 비율 구하기 -> 'Sample : Crewed area'
saturnVPayload = 43500
missions['Sample : Crewed area'] = missions['Total weight (kg)'] / saturnVPayload
missions

,Mission,Sample weight (kg),Weight diff,Lunar module (LM),LM mass (kg),LM mass diff,Command Module (CM),CM mass (kg),CM mass diff,Total weight (kg),Total weight diff,Sample : Crewed area,Crewed area : Payload
0,Apollo11,21.554240,0.000000,Eagle (LM-5),15103,0.000000,Columbia (CSM-107],5560,0.000000,20663,0.000000,0.475011,0.475011
1,Apollo12,34.342380,12.788140,Intrepid (LM-6),15235,132.000000,Yankee Clipper (CM-100]),5609,49.000000,20844,181.000000,0.479172,0.479172
2,Apollo14,41.833630,7.491250,Antares (LM-8),15264,29.000000,Kitty Hawk (CM-110),5758,149.000000,21022,178.000000,0.483264,0.483264
3,Apollo15,75.399100,33.565470,Falcon (LM-10),16430,1166.000000,Endeavor (CM-112),5875,117.000000,22305,1283.000000,0.512759,0.512759
4,Apollo16,92.462620,17.063520,Orion (LM-11),16445,15.000000,Casper (CM-113),5840,-35.000000,22285,-20.000000,0.512299,0.512299
5,Apollo17,109.444020,16.981400,Challenger (LM-12),16456,11.000000,America (CM-114),5960,120.000000,22416,131.000000,0.515310,0.515310

In [52]:
# 페이로드에서 샘플이 차지하는 비율 구하기 -> 'Sample : Payload'
missions['Sample : Payload'] = missions['Sample weight (kg)'] / saturnVPayload
missions

,Mission,Sample weight (kg),Weight diff,Lunar module (LM),LM mass (kg),LM mass diff,Command Module (CM),CM mass (kg),CM mass diff,Total weight (kg),Total weight diff,Sample : Crewed area,Crewed area : Payload,Sample : Payload
0,Apollo11,21.554240,0.000000,Eagle (LM-5),15103,0.000000,Columbia (CSM-107],5560,0.000000,20663,0.000000,0.475011,0.475011,0.000495
1,Apollo12,34.342380,12.788140,Intrepid (LM-6),15235,132.000000,Yankee Clipper (CM-100]),5609,49.000000,20844,181.000000,0.479172,0.479172,0.000789
2,Apollo14,41.833630,7.491250,Antares (LM-8),15264,29.000000,Kitty Hawk (CM-110),5758,149.000000,21022,178.000000,0.483264,0.483264,0.000962
3,Apollo15,75.399100,33.565470,Falcon (LM-10),16430,1166.000000,Endeavor (CM-112),5875,117.000000,22305,1283.000000,0.512759,0.512759,0.001733
4,Apollo16,92.462620,17.063520,Orion (LM-11),16445,15.000000,Casper (CM-113),5840,-35.000000,22285,-20.000000,0.512299,0.512299,0.002126
5,Apollo17,109.444020,16.981400,Challenger (LM-12),16456,11.000000,America (CM-114),5960,120.000000,22416,131.000000,0.515310,0.515310,0.002516

## artemis_mission 데이터프레임 만들기

In [54]:
artemis_crewedArea = 26520

artemis_dict = {'Mission' : ['artemis1', 'artemis1b', 'artemis2'],
                'Total weight (kg)' : [artemis_crewedArea, artemis_crewedArea, artemis_crewedArea],
                'Payload (kg)' : [26988, 37965, 42955]
               }

#딕셔너리를 데이터 프레임으로 저장하기
artemis_mission = pd.DataFrame(artemis_dict)
artemis_mission

     Mission  Total weight (kg)  Payload (kg)
0   artemis1              26520         26988
1  artemis1b              26520         37965
2   artemis2              26520         42955

In [ ]:
# missions 데이터프레임에서 'Crewed area : Payload', 'Sample : Crewed area', 'Sample : payload' 의 평균값을 구한다.

# 'Sample : Crewed area' : Sample weight from total (kg) -> Total weight (kg)을 승무원영역에서 샘플이 차지하는 비율의 평균을 곱하기
# 'Sample : payload' : Sample weight from payload (kg) -> payload (kg) 에 페이로드에서 샘플이 차지하는 비율의 평균을 곱하기
# Estimated sample weight (kg) -> 아르테미스 미션에서 실제로 채취할 암석의 무게 ((Sample weight from total (kg) + Sample weight from payload (kg))/2)

In [65]:
missions['Sample : Crewed area'].mean()
missions['Sample : Payload'].mean()
missions['Sample : Crewed area'].mean()

np.float64(0.4963026819923371)

In [ ]:
#artemis_missions 데이터 프레임에 'Sample weight from total (kg)' 컬럼을 추가한다.

artemis_mission['Sample weight from total (kg)'] = artemis_mission['Total weight (kg)'] * missions['Sample : Crewed area'].mean()
artemis_mission

     Mission  Total weight (kg)  Payload (kg)  Sample weight from total (kg)
0   artemis1              26520         26988                   13161.947126
1  artemis1b              26520         37965                   13161.947126
2   artemis2              26520         42955                   13161.947126

In [ ]:
#artemis_mission 데이터프레임에 'Sample weight from payload (kg)' 컬럼을 추가한다.

artemis_mission['Sample weight from payload (kg)'] = artemis_mission['Payload (kg)'] * missions['Sample : Payload'].mean()
artemis_mission

,Mission,Total weight (kg),Payload (kg),Sample weight from total (kg),Sample weight from payload (kg)
0,artemis1,26520,26988,13161.947126,38.779584
1,artemis1b,26520,37965,13161.947126,54.552649
2,artemis2,26520,42955,13161.947126,61.722877

In [ ]:
# artemis_mission 데이터프레임에 'Estimated sample weight (kg)' 컬럼을 추가한다.

artemis_mission['Estimated Sample weight (kg)'] = (artemis_mission['Sample weight from total (kg)'] + artemis_mission['Sample weight from payload (kg)'])/2
artemis_mission

,Mission,Total weight (kg),Payload (kg),Sample weight from total (kg),Sample weight from payload (kg),Estimated Sample weight (kg)
0,artemis1,26520,26988,13161.947126,38.779584,6600.363355
1,artemis1b,26520,37965,13161.947126,54.552649,6608.249888
2,artemis2,26520,42955,13161.947126,61.722877,6611.835002

In [ ]:
# missions 데이터프레임에서 'Sample weight (kg)'의 총합을 구한다.

##아르테미스 임무에서 가져올 암석 종류 구하기

In [68]:
# df의 5개 정보 확인하기
df.describe()

                ID  Weight (kg)  Pristine (%)
count  2229.000000  2229.000000   2229.000000
mean  52058.432032     0.168253     84.512764
std   26207.651471     0.637286     22.057299
min   10001.000000     0.000000      0.000000
25%   15437.000000     0.003000     80.010000
50%   65527.000000     0.010200     92.300000
75%   72142.000000     0.093490     98.140000
max   79537.000000    11.729000    180.000000

In [ ]:
# df 데이터프레임에 암석샘플의 남은 양을 나타내는 'Remaining (kg)' 컬럼추가

In [ ]:
# df 수치데이터 요약 통계 확인

In [ ]:
# df['Weight (kg)']의 모든 값이 0.16kg 이상 인지 확인

In [79]:
# df['Weight (kg)']이 0.16kg 이상 이면서 df['Pristine (%)']이 50 이하인지 확인
#위의 두 조건을 모두 만족하는 행만 추출해서 low_samples라는 데이터 프레임을 만든다.


low_samples = df[(df['Weight (kg)'] >= 0.16) & (df['Pristine (%)'] <= 50)]
low_samples

         ID   Mission     Type      Subtype  Weight (kg)  Pristine (%)
11    10017  Apollo11   Basalt     Ilmenite     0.973000     43.710000
14    10020  Apollo11   Basalt     Ilmenite     0.425000     27.880000
15    10021  Apollo11  Breccia     Regolith     0.250000     30.210000
29    10045  Apollo11   Basalt      Olivine     0.185000     12.130000
37    10057  Apollo11   Basalt     Ilmenite     0.919000     35.150000
39    10059  Apollo11  Breccia     Regolith     0.188000     36.940000
52    10072  Apollo11   Basalt     Ilmenite     0.447000     15.220000
59    10086  Apollo11     Soil     Unsieved     0.823000      0.010000
68    12002  Apollo12   Basalt      Olivine     1.530000     49.040000
69    12003  Apollo12     Soil     Unsieved     0.300000     28.520000
72    12006  Apollo12   Basalt      Olivine     0.206400      0.530000
94    12028  Apollo12     Core     Unsieved     0.189600     27.560000
113   12047  Apollo12   Basalt     Ilmenite     0.193000     33.700000
118   12053  Apollo12   Basalt    Pigeonite     0.879000     46.430000
120   12055  Apollo12   Basalt    Pigeonite     0.912000     26.000000
353   15012  Apollo15     Soil     Unsieved     0.312200      5.770000
354   15013  Apollo15     Soil     Unsieved     0.296200      8.800000
426   15205  Apollo15  Breccia     Regolith     0.337300     24.700000
534   15405  Apollo15  Breccia   ImpactMelt     0.513100     35.910000
570   15475  Apollo15   Basalt    Pigeonite     0.406800     49.600000
575   15498  Apollo15  Breccia     Regolith     2.340000     34.110000
607   15555  Apollo15   Basalt      Olivine     9.614000     46.610000
718   60016  Apollo16  Breccia   Fragmental     4.307000     49.570000
722   60025  Apollo16  Breccia  Anorthosite     1.836000     43.610000
1221  66075  Apollo16  Breccia   Fragmental     0.347100     32.970000
1645  71566  Apollo17   Basalt     Ilmenite     0.414400     45.060000
2183  79155  Apollo17   Basalt     Ilmenite     0.318800     25.970000

In [80]:
low_samples.info()

<class 'pandas.core.frame.DataFrame'>
Index: 27 entries, 11 to 2183
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            27 non-null     int64
 1   Mission       27 non-null     object
 2   Type          27 non-null     object
 3   Subtype       27 non-null     object
 4   Weight (kg)   27 non-null     float64
 5   Pristine (%)  27 non-null     float64
dtypes: float64(2), int64(1), object(3)
memory usage: 1.5+ KB

In [81]:
# low_samples 데이터프레임에서 암석유형('Type')별로 개수를 센다.
low_samples['Type'].unique()

array(['Basalt', 'Breccia', 'Soil', 'Core'], dtype=object)

In [82]:
low_samples['Type'].value_counts()

Type
Basalt     14
Breccia     8
Soil        4
Core        1
Name: count, dtype: int64

In [83]:
#low_samples['Type']의 값이 'Basalt'이거나 'Breccia' 인지 확인 -> isin(리스트)
low_samples['Type'].isin(['Basalt','Breccia'])

11       True
14       True
15       True
29       True
37       True
39       True
52       True
59      False
68       True
69      False
72       True
94      False
113      True
118      True
120      True
353     False
354     False
426      True
534      True
570      True
575      True
607      True
718      True
722      True
1221     True
1645     True
2183     True
Name: Type, dtype: bool

In [85]:
# low_samples['Type'] 의 값이 'Basalt'이거나 'Breccia'인 행만 추출해서 needed_samples 데이터프레임 만들기
needed_samples = low_samples[low_samples['Type'].isin(['Basalt','Breccia'])]

In [86]:
# needed_samples 정보확인
needed_samples

         ID   Mission     Type      Subtype  Weight (kg)  Pristine (%)
11    10017  Apollo11   Basalt     Ilmenite     0.973000     43.710000
14    10020  Apollo11   Basalt     Ilmenite     0.425000     27.880000
15    10021  Apollo11  Breccia     Regolith     0.250000     30.210000
29    10045  Apollo11   Basalt      Olivine     0.185000     12.130000
37    10057  Apollo11   Basalt     Ilmenite     0.919000     35.150000
39    10059  Apollo11  Breccia     Regolith     0.188000     36.940000
52    10072  Apollo11   Basalt     Ilmenite     0.447000     15.220000
68    12002  Apollo12   Basalt      Olivine     1.530000     49.040000
72    12006  Apollo12   Basalt      Olivine     0.206400      0.530000
113   12047  Apollo12   Basalt     Ilmenite     0.193000     33.700000
118   12053  Apollo12   Basalt    Pigeonite     0.879000     46.430000
120   12055  Apollo12   Basalt    Pigeonite     0.912000     26.000000
426   15205  Apollo15  Breccia     Regolith     0.337300     24.700000
534   15405  Apollo15  Breccia   ImpactMelt     0.513100     35.910000
570   15475  Apollo15   Basalt    Pigeonite     0.406800     49.600000
575   15498  Apollo15  Breccia     Regolith     2.340000     34.110000
607   15555  Apollo15   Basalt      Olivine     9.614000     46.610000
718   60016  Apollo16  Breccia   Fragmental     4.307000     49.570000
722   60025  Apollo16  Breccia  Anorthosite     1.836000     43.610000
1221  66075  Apollo16  Breccia   Fragmental     0.347100     32.970000
1645  71566  Apollo17   Basalt     Ilmenite     0.414400     45.060000
2183  79155  Apollo17   Basalt     Ilmenite     0.318800     25.970000

In [89]:
df['Type'].value_counts()

Type
Breccia    959
Soil       813
Basalt     351
Core        56
Crustal     46
Special      4
Name: count, dtype: int64

In [92]:
# needed_samples 데이터프레임에서 'Type'으로 groupby해서 암석 샘플의 총중량의 합을 구한다

needed_samples.groupby('Type')['Weight (kg)'].sum()

Type
Basalt    17.423400
Breccia   10.118500
Name: Weight (kg), dtype: float64

In [ ]:
# df 데이터프레임에서 'Type'으로 groupby 해서 암석 샘플의 중량의 합을 구한다. 
#           -> 아폴로 임무에서 처음부터 수집이 안된 암석을 구한다.

In [ ]:
df['Type'] == 'Crustal'

In [91]:
# df에서 'Type'이 'Crustal'. 인 행만 추출한다.
df[df['Type'] == 'Crustal']

         ID   Mission     Type      Subtype  Weight (kg)  Pristine (%)
497   15361  Apollo15  Crustal  Cataclastic     0.000900     66.560000
498   15362  Apollo15  Crustal  Cataclastic     0.004200     56.880000
499   15363  Apollo15  Crustal  Cataclastic     0.000500     71.000000
540   15415  Apollo15  Crustal  Anorthosite     0.269400     67.070000
557   15437  Apollo15  Crustal  Anorthosite     0.001000     80.000000
731   60057  Apollo16  Crustal  Anorthosite     0.003100    100.000000
733   60059  Apollo16  Crustal  Anorthosite     0.001050    100.000000
769   60619  Apollo16  Crustal  Anorthosite     0.028000     90.750000
802   61017  Apollo16  Crustal  Anorthosite     0.002620    100.000000
831   61226  Apollo16  Crustal  Anorthosite     0.001530    100.000000
887   61577  Apollo16  Crustal  Anorthosite     0.000210     76.190000
894   62236  Apollo16  Crustal  Anorthosite     0.057270     76.760000
895   62237  Apollo16  Crustal  Anorthosite     0.062350     62.810000
896   62238  Apollo16  Crustal  Anorthosite     0.001570    100.000000
903   62246  Apollo16  Crustal  Anorthosite     0.004590     95.490000
1009  64516  Apollo16  Crustal  Anorthosite     0.002930     94.230000
1012  64519  Apollo16  Crustal  Anorthosite     0.001120     95.550000
1013  64525  Apollo16  Crustal  Anorthosite     0.001110     86.720000
1201  65909  Apollo16  Crustal  Anorthosite     0.002020     86.360000
1203  65916  Apollo16  Crustal  Anorthosite     0.000990     95.980000
1313  67635  Apollo16  Crustal  Anorthosite     0.009120     87.370000
1314  67636  Apollo16  Crustal  Anorthosite     0.003230     87.620000
1315  67637  Apollo16  Crustal  Anorthosite     0.002340     88.680000
1401  67955  Apollo16  Crustal   Fragmental     0.162600     85.940000
1721  72415  Apollo17  Crustal  Cataclasite     0.032340     58.890000
1722  72416  Apollo17  Crustal  Cataclasite     0.011530     64.610000
1723  72417  Apollo17  Crustal  Cataclasite     0.011320      2.760000
1724  72418  Apollo17  Crustal  Cataclasite     0.003550     88.250000
1762  72559  Apollo17  Crustal  Cataclasite     0.027800     95.410000
1793  73146  Apollo17  Crustal  Cataclasite     0.003010     90.030000
1957  76235  Apollo17  Crustal  Cataclasite     0.026560     60.360000
1999  76335  Apollo17  Crustal  Cataclasite     0.502890     97.140000
2008  76535  Apollo17  Crustal   Troctolite     0.155500     47.890000
2009  76536  Apollo17  Crustal  Cataclasite     0.010260     93.160000
2032  77017  Apollo17  Crustal  Cataclasite     1.730000     93.140000
2037  77077  Apollo17  Crustal  Cataclasite     0.000000     90.640000
2043  77215  Apollo17  Crustal  Cataclasite     0.846400     93.030000
2075  78155  Apollo17  Crustal  Cataclasite     0.000000     87.660000
2086  78235  Apollo17  Crustal       Norite     0.199000     69.760000
2087  78236  Apollo17  Crustal       Norite     0.000000     87.730000
2088  78237  Apollo17  Crustal       Norite     0.000000      0.000000
2089  78238  Apollo17  Crustal       Norite     0.000000     86.030000
2092  78256  Apollo17  Crustal     Pristine     0.000000      0.000000
2126  78517  Apollo17  Crustal  Cataclasite     0.001820     82.970000
2130  78527  Apollo17  Crustal  Cataclasite     0.005160     82.050000
2189  79215  Apollo17  Crustal  Cataclasite     0.553800     93.330000

In [94]:
crustal = df[df['Type'] == 'Crustal']

In [97]:
# needed_samples에 crustal을 추가한다.
needed_samples = pd.concat([needed_samples,crustal])

In [98]:
needed_samples.info()

<class 'pandas.core.frame.DataFrame'>
Index: 68 entries, 11 to 2189
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            68 non-null     int64
 1   Mission       68 non-null     object
 2   Type          68 non-null     object
 3   Subtype       68 non-null     object
 4   Weight (kg)   68 non-null     float64
 5   Pristine (%)  68 non-null     float64
dtypes: float64(2), int64(1), object(3)
memory usage: 3.7+ KB

In [99]:
needed_samples.Type.unique()

array(['Basalt', 'Breccia', 'Crustal'], dtype=object)

In [100]:
needed_samples['Type'].unique()

array(['Basalt', 'Breccia', 'Crustal'], dtype=object)

## needed samples overview 만들기

In [142]:
## 아르테미스 임무에 전달할 최종 데이터프레임 needed_samples_overview 만든다.

needed_sample_overview = pd.DataFrame()
needed_sample_overview

Empty DataFrame
Columns: []
Index: []

In [143]:
# needed samples 데이터프레임에서 중복되지 않은 암석유형을 추출한다.
needed_samples['Type'].unique()

array(['Basalt', 'Breccia', 'Crustal'], dtype=object)

In [144]:
needed_sample_overview['Type'] = needed_samples['Type'].unique()
needed_sample_overview

      Type
0   Basalt
1  Breccia
2  Crustal

In [145]:
# needed_samples 데이터프레임에서 암석유형별('Type') 중량 합을 구한다.

needed_samples.groupby('Type')['Weight (kg)'].sum()

Type
Basalt    17.423400
Breccia   10.118500
Crustal    4.744690
Name: Weight (kg), dtype: float64

In [146]:
needed_samples.groupby('Type')['Weight (kg)'].sum().values

array([17.4234 , 10.1185 ,  4.74469])

In [147]:
needed_sample_overview['Total weight (kg)'] = needed_samples.groupby('Type')['Weight (kg)'].sum().values
needed_sample_overview

      Type  Total weight (kg)
0   Basalt          17.423400
1  Breccia          10.118500
2  Crustal           4.744690

In [148]:
needed_sample_weight = needed_samples.groupby('Type')['Weight (kg)'].sum().reset_index()
needed_sample_weight

      Type  Weight (kg)
0   Basalt    17.423400
1  Breccia    10.118500
2  Crustal     4.744690

In [ ]:
# needed_samples 데이터프레임에서 암석유형별 중량의 평균을 구한다.

In [149]:
needed_sample_overview['Average weight (kg)'] = needed_samples.groupby('Type')['Weight (kg)'].mean().values
needed_sample_overview

      Type  Total weight (kg)  Average weight (kg)
0   Basalt          17.423400             1.244529
1  Breccia          10.118500             1.264813
2  Crustal           4.744690             0.103145

In [150]:
# df.groupby('Type')['ID'].count() 처럼 Series 형식 데이터를 데이터프레임으로 쉽게 바꾸는 방법 : reset_index()
df.groupby('Type')['ID'].count().reset_index()

      Type   ID
0   Basalt  351
1  Breccia  959
2     Core   56
3  Crustal   46
4     Soil  813
5  Special    4

In [151]:
# df 데이터프레임에서 암석유형별('Type') 개수를 구해서 total_rock_count 라는 데이터프레임을 만든다.

total_rock_count = df.groupby('Type')['ID'].count().reset_index()
total_rock_count

      Type   ID
0   Basalt  351
1  Breccia  959
2     Core   56
3  Crustal   46
4     Soil  813
5  Special    4

In [152]:
# 두 데이터프레임을 병합한다.
needed_sample_overview = pd.merge(needed_sample_overview, total_rock_count, on='Type')
needed_sample_overview

      Type  Total weight (kg)  Average weight (kg)   ID
0   Basalt          17.423400             1.244529  351
1  Breccia          10.118500             1.264813  959
2  Crustal           4.744690             0.103145   46

In [153]:
# 컬럼명을 변경한다. 'ID' -> 'Number of samples'

needed_sample_overview.rename(columns={'ID' : 'Number of samples'}, inplace=True)
needed_sample_overview

      Type  Total weight (kg)  Average weight (kg)  Number of samples
0   Basalt          17.423400             1.244529                351
1  Breccia          10.118500             1.264813                959
2  Crustal           4.744690             0.103145                 46

In [154]:
# needed_samples_overview['Number of samples'] 의 총합을 구하고 total_rocks에 할당
needed_sample_overview['Number of samples'] / needed_sample_overview['Number of samples'].sum()

0   0.258850
1   0.707227
2   0.033923
Name: Number of samples, dtype: float64

In [162]:
# 각 암석유형별로 차지하는 비율을 구해서 'Percentage of rocks'라는 컬럼에 할당한다.
needed_sample_overview['Percentage of rocks'] = needed_sample_overview['Number of samples'] / needed_sample_overview['Number of samples'].sum()
needed_sample_overview

,Type,Total weight (kg),Average weight (kg),Number of samples,Percentage of rocks,Weight to collect
0,Basalt,17.423400,1.244529,351,0.258850,2318992.444602
1,Breccia,10.118500,1.264813,959,0.707227,6335936.622146
2,Crustal,4.744690,0.103145,46,0.033923,303913.539748

In [163]:
artemis_mission

,Mission,Total weight (kg),Payload (kg),Sample weight from total (kg),Sample weight from payload (kg),Estimated Sample weight (kg)
0,artemis1,26520,26988,13161.947126,38.779584,6600.363355
1,artemis1b,26520,37965,13161.947126,54.552649,6608.249888
2,artemis2,26520,42955,13161.947126,61.722877,6611.835002

In [165]:
# artemis_mission['Estimated sample weight (kg)']의 평균을 구해서 Artemis 달탐사의 에상 암석 중량을 구한다.
needed_sample_overview['Percentage of rocks'] * artemis_mission['Estimated Sample weight (kg)'].mean()

0   1710.171419
1   4672.519633
2    224.125029
Name: Percentage of rocks, dtype: float64

In [167]:
# needed_samples_overview['Weight to collect'] 컬럼을 만든다.
needed_sample_overview['Weight to collect'] = needed_sample_overview['Percentage of rocks'] * artemis_mission['Estimated Sample weight (kg)'].mean()
needed_sample_overview

,Type,Total weight (kg),Average weight (kg),Number of samples,Percentage of rocks,Weight to collect
0,Basalt,17.423400,1.244529,351,0.258850,1710.171419
1,Breccia,10.118500,1.264813,959,0.707227,4672.519633
2,Crustal,4.744690,0.103145,46,0.033923,224.125029

In [169]:
# 수집할 각각의 암석 개수를 알려준다.
needed_sample_overview['Rocks to collect'] = needed_sample_overview['Weight to collect'] / needed_sample_overview['Average weight (kg)']
needed_sample_overview

,Type,Total weight (kg),Average weight (kg),Number of samples,Percentage of rocks,Weight to collect,Rocks to collect
0,Basalt,17.423400,1.244529,351,0.258850,1710.171419,1374.151995
1,Breccia,10.118500,1.264813,959,0.707227,4672.519633,3694.238974
2,Crustal,4.744690,0.103145,46,0.033923,224.125029,2172.903045